package local.home01.task01.main;
/*
 * Дан прямоугольник, ширина которого в два раза меньше длины.
 * Найти площадь прямоугольника
 */

public class Task07 {
	
	public static void main(String[] args) {
		
	int a = 16;// Длина прямоуголника //
	int b = a / 2; // Ширина прямоуголника //
	int s = (a + b) * 2; // Площадь прямоуголника //
	
	System.out.println("Площадь прямоуголника s = " + s);
		
		
		
	}

}
