package local.home01.task01.main;

/* Даны два действительных числа х и у. 
 * Вычислить их сумму, разность, произведение и частное.
*/
public class Task01 {
	
	public static void main(String[] args) {
		
		int x = 20;
		int y = 5;
		int a1 = x - y;
		int a2 = x + y;
		int a3 = x * y;
		int a4 = x / y;
		
		System.out.println("Разность = " + a1);
		System.out.println("Сумма = " + a2);
		System.out.println("Произведение = " + a3);
		System.out.println("Частное = " + a4);

}
	
}
