package local.home01.task01.main;
/*
 * Вычислить длину окружности 
 * и площадь круга одного и того же заданного радиуса R.
 */

public class Task14 {
		
		public static void main(String[] args) {
			
			int R = 7;
			
			Double L = 2 * Math.PI * R;
			Double S = Math.PI * Math.pow(R, 2);
			
			System.out.println("Длинна окружности L = " + L);
			System.out.println("Площадь круга S = " + S);
			
			
			
			
			
			
		}

}
