package local.home01.task01.main;
/*
 * Написать программу,
 * которая выводит на экран первые четыре степени числа π
 */

public class Task15 {
	
	
	public static void main(String[] args) {
		
		for(int i = 1; i <= 4; i++) {
			
			double G = Math.pow(Math.PI, i);
			System.out.println("Степень π = " + G);
		}
		
		

		
		
		
	}





}