package local.home02.task01.main;
/*
 * Написать  программу  —  модель  анализа  пожарного  датчика  в  помещении, 
 * которая  выводит  сообщение 
 *«Пожароопасная ситуация », если температура в комнате превысила 60° С.
 */

public class Task25 {
	
	public static void main(String[] args) {
		
		int c = 70;
		
		if (c > 60) {
			
			System.out.println("Пожароопасная ситуация");
			
		}
		
	}

}

